
[
  {
    "id": 1,
    "titulo": "Interstellar",
    "fecha": "2014",
    "precio": 320,
    "description": "Un grupo de exploradores viaja por un agujero de gusano en busca de un nuevo hogar.",
    "descriptionModal": "En un futuro distópico donde la Tierra se enfrenta a una crisis alimentaria y ambiental, el exingeniero y piloto Cooper se une a una misión interestelar que podría ser la última esperanza para la humanidad. Liderando un grupo de científicos, Cooper viaja a través de un agujero de gusano en busca de un planeta habitable, enfrentándose a desafíos que van más allá de la comprensión humana, incluyendo la relatividad del tiempo y las decisiones morales imposibles. Interstellar combina ciencia, emociones y sacrificio en una narrativa que explora la resistencia del espíritu humano y la conexión que trasciende las barreras del espacio y el tiempo.",
    "icono": "https://res.cloudinary.com/dkdaofdcx/image/upload/v1736350666/20_aj57ns.jpg",
    "video": "https://www.youtube.com/embed/zSWdZVtXT7E?si=wKiUkEoNPSMxDyF3",
    "categoria": "Ciencia-ficcion"
  },
  {
    "id": 2,
    "titulo": "The Lion King",
    "fecha": "1994",
    "precio": 250,
    "description": "Un joven león debe aceptar su destino como rey tras enfrentar la pérdida y la traición.",
    "descriptionModal": "En el corazón de las vastas llanuras africanas, un joven león llamado Simba inicia su camino hacia la adultez y la aceptación de su destino como el legítimo rey de la Roca del Rey. Tras la trágica muerte de su padre, el noble Mufasa, Simba huye, creyendo ser responsable de lo ocurrido. En su exilio, encuentra nuevos amigos y un estilo de vida despreocupado que contrasta con la gravedad de su misión. Sin embargo, el reinado tiránico de su tío Scar sobre la manada lo lleva a regresar y enfrentarse a sus miedos. En un épico duelo por el futuro del reino, Simba descubre el poder del coraje, la amistad y la responsabilidad, mientras reclama su lugar en el ciclo de la vida.",
    "icono": "./public/peliculasImagenes/15.jpeg",
    "video": "https://www.youtube.com/embed/lFzVJEksoDY?si=K_GnmGpYoIfCjZjc",
    "categoria": "Animacion"
  },
    {
      "id": 3,
      "titulo": "Ratatouille",
      "fecha": "2007",
      "precio": 300,
      "description": "Un ratón con un talento culinario único se une a un joven chef para conquistar el mundo de la alta cocina en París.",
      "descriptionModal": "En el corazón de París, un ratón llamado Remy sueña con convertirse en un chef a pesar de la oposición de su familia y del hecho de ser una plaga en el mundo humano. Cuando se cruza con Linguini, un joven sin talento en la cocina, juntos forman un equipo improbable que desafía las normas culinarias y crea platos inolvidables que sorprenden a todos, incluso al crítico más duro de la ciudad.",
      "icono": "./public/peliculasImagenes/3.jpg",
      "video": "https://www.youtube.com/embed/NgsQ8mVkN8w?si=9Am-0NK5KODeSkWd",
      "categoria": "Aventura"   
    },
    {
      "id": 4,
      "titulo": "The Dark Knight",
      "fecha": "2008",
      "precio": 350,
      "description": "Batman se enfrenta al Joker, un criminal anárquico que pone a Gotham City en peligro.",
      "descriptionModal": "En The Dark Knight, Gotham City enfrenta una ola de caos cuando un nuevo villano, el Joker, emerge para sembrar el pánico y retar los ideales de la sociedad. Bruce Wayne, bajo su alter ego como Batman, debe enfrentarse a dilemas éticos y emocionales mientras lucha por proteger la ciudad que juró salvar. Con la ayuda del tenaz comisionado Gordon y el fiscal Harvey Dent, Batman intenta desmantelar la red criminal que amenaza con destruir Gotham. Sin embargo, el Joker lleva a todos al límite, desatando un juego psicológico que redefine la línea entre el bien y el mal, y pone a prueba el verdadero significado del heroísmo.",
      "icono": "./public/peliculasImagenes/4.jpg",
      "video": "https://www.youtube.com/embed/EXeTwQWrcwY?si=-4gP_WAem6qJzBLv",
      "categoria": "Accion"
    },
    {
      "id": 5,
      "titulo": "Avengers: Endgame",
      "fecha": "2019",
      "precio": 400,
      "description": "Los Vengadores deben unirse para derrotar a Thanos y revertir los daños causados por su ataque.",
      "descriptionModal": "En Avengers: Endgame, los Vengadores enfrentan su mayor desafío tras la devastadora derrota a manos de Thanos, quien borró a la mitad de la población del universo con un simple chasquido. Superando el dolor y la pérdida, los héroes restantes —Iron Man, Capitán América, Thor, Hulk, Black Widow y Hawkeye— se unen una vez más, fortalecidos por nuevos aliados, para idear un plan audaz que podría deshacer el daño causado. En una épica lucha contra el tiempo y el destino, los Vengadores se embarcan en un viaje que los lleva a explorar sus propios errores, sacrificios y legados. La batalla culmina en un enfrentamiento monumental que redefine el concepto de unidad y sacrificio, mientras los héroes luchan para restaurar la esperanza y el equilibrio en el universo.",
      "icono": "./public/peliculasImagenes/5.jpg",
      "video": "https://www.youtube.com/embed/TcMBFSGVi1c?si=YOXH2un5DNnilHKw",
      "categoria": "Accion"
    },
    {
      "id": 6,
      "titulo": "Inception",
      "fecha": "2010",
      "precio": 275,
      "description": "Un ladrón de sueños se infiltra en los sueños de otros para robar secretos, pero recibe una tarea imposible.",
      "descriptionModal": "En **Inception**, Dom Cobb es un ladrón con una habilidad única: puede infiltrarse en los sueños de las personas y robarles sus secretos más profundos mientras duermen. Este talento lo convierte en un fugitivo internacional y le cuesta todo lo que ama. Sin embargo, se le presenta una oportunidad de redención cuando un poderoso empresario le encarga realizar una tarea casi imposible: el origen. En lugar de robar una idea, debe implantar una en la mente de un objetivo, algo que nunca se ha intentado antes. Cobb reúne un equipo de expertos para llevar a cabo la misión, pero a medida que avanzan, los límites entre la realidad y el sueño comienzan a desdibujarse. Perseguidos por sus propios demonios internos, especialmente por los recuerdos de su difunta esposa Mal, el equipo debe enfrentarse a peligros mortales dentro de los niveles de los sueños, cada uno más complejo y traicionero que el anterior. Con el tiempo en su contra y el riesgo de quedar atrapados en un limbo infinito, **Inception** lleva a los personajes y al público a una fascinante exploración de la mente, la percepción y el poder de las ideas, culminando en un final que deja a todos cuestionando qué es real y qué no.",
      "icono": "./public/peliculasImagenes/6.jpg",
      "video": "https://www.youtube.com/embed/YoHD9XEInc0?si=SOgkCLTbIj0frfIa",
      "categoria": "Accion"
      
    },
    {
      "id": 7,
      "titulo": "The Matrix",
      "fecha": "1999",
      "precio": 260,
      "description": "Un hacker descubre que el mundo que conoce es una simulación controlada por máquinas.",
      "descriptionModal": "En The Matrix, Thomas Anderson, un programador de día y hacker conocido como Neo de noche, se ve envuelto en una realidad inquietante cuando descubre que el mundo que conoce es una simulación creada por máquinas inteligentes. Estas máquinas mantienen a la humanidad esclavizada dentro de una ilusión llamada la Matriz para aprovechar la energía humana como fuente de combustible. Neo es contactado por Morfeo, un líder rebelde que cree que Neo es El Elegido, un individuo profetizado para liberar a la humanidad y derrotar a las máquinas. Después de elegir tomar la píldora roja, Neo despierta en el mundo real, un entorno distópico donde los humanos luchan por sobrevivir. Entrenado en habilidades extraordinarias dentro de la Matriz y acompañado por Trinity y el resto de la tripulación de la nave Nabucodonosor, Neo explora los límites de sus habilidades mientras intenta aceptar su papel como salvador. La película explora conceptos filosóficos como la percepción de la realidad, el libre albedrío y el sacrificio, mientras ofrece escenas de acción revolucionarias y efectos visuales innovadores. En un enfrentamiento final con el implacable Agente Smith, un programa diseñado para proteger la Matriz, Neo comienza a comprender su verdadero poder, marcando el inicio de una épica lucha por la liberación de la humanidad.",
      "icono": "./public/peliculasImagenes/7.jpg",
      "video": "https://www.youtube.com/embed/Pl_H2Lmjn6k?si=p6XDQHsLM7xHL9j8",
      "categoria": "Accion"
      
    },
    {
      "id": 8,
      "titulo": "Titanic",
      "fecha": "1997",
      "precio": 230,
      "description": "Una historia de amor épica entre Jack y Rose a bordo del fatídico RMS Titanic.",
      "descriptionModal": "En Titanic, la historia de amor entre Jack y Rose se desarrolla a bordo del majestuoso y desmesurado transatlántico RMS Titanic, que se embarca en su viaje inaugural desde Southampton hacia Nueva York en 1912. Jack, un joven artista sin recursos, gana un boleto en el barco en una partida de póker, mientras que Rose, una aristócrata atrapada en un compromiso con el adinerado Cal, lucha por encontrar su propia libertad. A lo largo del viaje, los dos se enamoran, desafiando las convenciones sociales y la opresión de sus respectivos mundos. Mientras su romance se intensifica, el Titanic, considerado insumergible, se enfrenta a su destino trágico cuando choca contra un iceberg. A medida que el barco comienza a hundirse, Jack y Rose luchan por sobrevivir en medio del caos y la desesperación. La película narra no solo una historia de amor épica, sino también una de sacrificio, tragedia y valentía. El colapso del Titanic se convierte en un símbolo de la fragilidad humana frente a la naturaleza imparable, mientras los pasajeros luchan por encontrar esperanza y sobrevivir. En el desenlace, Rose, ya anciana, rememora su experiencia, dejando atrás la historia de su gran amor, en una de las tragedias más impactantes de la historia del cine.",
      "icono": "./public/peliculasImagenes/8.jpg",
      "video": "https://www.youtube.com/embed/tA_qMdzvCvk?si=Lk8BGHovNkqWVsHE",
      "categoria": "Drama"
    },
    {
      "id": 9,
      "titulo": "Jurassic Park",
      "fecha": "1993",
      "precio": 270,
      "description": "Un parque temático de dinosaurios se convierte en un desastre cuando los animales se liberan.",
      "descriptionModal": "En *Jurassic Park*, un grupo de científicos logra crear un parque temático revolucionario en una isla deshabitada, donde los visitantes pueden ver dinosaurios clonados en un entorno controlado. El multimillonario dueño del parque, John Hammond, invita a un grupo de expertos, incluidos los paleontólogos Dr. Alan Grant y Dr. Ellie Sattler, a que lo visiten y certifiquen la seguridad del lugar. Sin embargo, una serie de eventos imprevistos provoca un apagón en el sistema de seguridad, liberando a los dinosaurios, que comienzan a cazar a los humanos. Mientras el caos se desata, los personajes deben luchar por sobrevivir en un mundo donde los dinosaurios dominan nuevamente. La película es una combinación de ciencia ficción, suspenso y aventura, explorando los límites de la ciencia y la ética de jugar con la naturaleza.",
      "icono": "./public/peliculasImagenes/9.jpg",
      "video": "https://www.youtube.com/embed/dLDkNge_AhE?si=_rbSWGD437O_bGpv",
      "categoria": "Accion"  
    },
    {
      "id": 10,
      "titulo": "Star Wars: A New Hope",
      "fecha": "1997",
      "precio": 300,
      "description": "Un joven llamado Luke Skywalker se une a una lucha contra el Imperio para salvar la galaxia.",
      "descriptionModal": "En *Star Wars: A New Hope*, la galaxia está bajo el control del malvado Imperio Galáctico, que busca aplastar cualquier resistencia. La historia sigue a Luke Skywalker, un joven granjero en el planeta Tatooine, quien se ve envuelto en una misión para rescatar a la princesa Leia Organa, quien ha sido capturada por las fuerzas del Imperio. Con la ayuda del contrabandista Han Solo, su copiloto Chewbacca, el robot R2-D2 y el sabio Jedi Obi-Wan Kenobi, Luke se embarca en una peligrosa aventura que lo lleva al centro del conflicto galáctico. A lo largo de su viaje, Luke comienza a descubrir su propio destino como Jedi y a enfrentarse al malvado Darth Vader, quien sirve como el brazo derecho del Imperio. En una batalla épica, la Rebelión lucha para destruir la Estrella de la Muerte, una estación espacial con el poder de destruir planetas enteros. *Star Wars: A New Hope* es una historia de heroísmo, sacrificio y lucha por la libertad, que establece los cimientos de una de las franquicias más influyentes y queridas de la historia del cine.",
      "icono": "./public/peliculasImagenes/10.jpg",
      "video":"https://www.youtube.com/embed/ChiOI5pX1mI?si=luNUSzhPJNP7gD0f",
      "categoria": "Accion"   
    },
    {
      "id": 11,
      "titulo": "Pulp Fiction",
      "fecha": "1994",
      "precio": 220,
      "description": "Tres historias entrelazadas que giran en torno a la vida de los criminales de Los Ángeles.",
      "descriptionModal": "En *Pulp Fiction*, Quentin Tarantino teje una compleja narrativa que entrelaza las vidas de criminales, boxeadores, y personajes marginales en Los Ángeles. La historia sigue a Vincent Vega y Jules Winnfield, dos asesinos a sueldo que trabajan para el temido jefe mafioso Marsellus Wallace. Entre sus misiones se encuentra recuperar un misterioso maletín y lidiar con situaciones absurdas, como un accidente inesperado en el coche. Por otro lado, se cuenta la historia de Butch Coolidge, un boxeador que traiciona a Wallace al no perder una pelea arreglada, lo que lo pone en una situación peligrosa. Además, Mia Wallace, la esposa del jefe mafioso, vive una inolvidable noche con Vincent, llena de baile, drama y un susto médico. Las historias se entrelazan a través de un estilo narrativo no lineal, donde el humor negro, los diálogos vibrantes y los giros inesperados revelan un mundo donde lo banal y lo grotesco coexisten. *Pulp Fiction* es una obra que redefine el cine de crimen y se ha convertido en un clásico moderno por su estilo único y personajes inolvidables.",
      "icono": "./public/peliculasImagenes/11.jpg",
      "video": "https://www.youtube.com/embed/WSLMN6g_Od4?si=9bpX5SnZ1zzhfgwW",
      "categoria": "Accion"    
    },
    {
      "id": 12,
      "titulo": "Forrest Gump",
      "fecha": "1994",
      "precio": 240,
      "description": "La historia de un hombre con una inteligencia limitada, pero con un corazón y alma grandes.",
      "descriptionModal": "Forrest Gump, un hombre con un coeficiente intelectual por debajo del promedio pero con un corazón inmenso, narra la increíble historia de su vida. Desde su infancia en Alabama, donde supera las burlas gracias al amor incondicional de su madre, hasta sus inesperadas hazañas que lo convierten en testigo de momentos cruciales de la historia estadounidense. Forrest se convierte en héroe de guerra en Vietnam, estrella de ping-pong, magnate de los negocios y corredor incansable, siempre movido por su sincero amor por Jenny, su amiga de la infancia y el motor de sus sueños. A pesar de las adversidades y su visión simplista de la vida, Forrest nos muestra que la bondad, la perseverancia y la inocencia pueden transformar incluso los desafíos más complejos en oportunidades para dejar una huella única en el mundo.",
      "icono": "./public/peliculasImagenes/12.jpg",
      "video": "https://www.youtube.com/embed/XHhAG-YLdk8?si=5WL2_vr-E72-227s",
      "categoria": "Drama"
    },
    {
      "id": 13,
      "titulo": "Gladiator",
      "fecha": "2000",
      "precio": 280,
      "description": "Un general romano busca venganza contra el emperador que asesinó a su familia.",
      "descriptionModal": "Aquí tienes una descripción larga para **Gladiador**:  En la Antigua Roma, el general Máximo Décimo Meridio se encuentra en la cúspide de su carrera, leal al emperador Marco Aurelio, quien lo ve como un heredero más digno que su propio hijo, Cómodo. Pero tras la traición de Cómodo y el asesinato de Marco Aurelio, Máximo es condenado a muerte. Escapa de su ejecución, pero pierde a su familia, lo que lo lleva a ser capturado y vendido como esclavo. Convertido en gladiador, Máximo lucha en arenas para ganar fama y respeto, buscando vengarse de Cómodo. Enfrentado a la corrupción del imperio y motivado por la pérdida de todo lo que amaba, Máximo se convierte en un símbolo de esperanza y resistencia para Roma, enfrentándose cara a cara con su enemigo en un épico duelo final que define su legado.",
      "icono": "./public/peliculasImagenes/13.jpg",
      "video": "https://www.youtube.com/embed/P5ieIbInFpg?si=JWFZg2LFkxKA3-nh",
      "categoria":"Accion"
    },
    {
      "id": 14,
      "titulo": "The Shawshank Redemption",
      "fecha": "1994",
      "precio": 300,
      "description": "Un hombre encarcelado injustamente encuentra esperanza y redención en la amistad y la resiliencia.",
      "descriptionModal": "En The Shawshank Redemption, Andy Dufresne, un banquero condenado injustamente por el asesinato de su esposa y su amante, es enviado a la prisión de Shawshank. Allí, enfrenta la brutalidad del sistema penitenciario mientras forma una inesperada amistad con Red, un contrabandista interno. A lo largo de los años, Andy usa su inteligencia y habilidades para ganarse la confianza de los guardias y del alcaide, mientras planea su escape. La película es una poderosa historia de esperanza, perseverancia y la capacidad del espíritu humano para resistir incluso en las circunstancias más desesperadas. La conmovedora relación entre Andy y Red sirve como eje central en esta obra maestra del cine, que explora temas como la libertad, la amistad y la redención.",
      "icono": "./public/peliculasImagenes/14.jpg",
      "video": "https://www.youtube.com/embed/NmzuHjWmXOc",
      "categoria": "Drama"
    },
    {
      "id": 15,
      "titulo": "Rápidos y Furiosos 6",
      "fecha": "2013",
      "precio": 200,
      "description": "Dominic Toretto, un experto en carreras y robos, se ve involucrado en un mundo de delincuencia.",
      "descriptionModal": "Rápidos y Furiosos 6 sigue a Dominic Toretto y su equipo mientras trabajan junto a la policía para capturar a un terrorista internacional. La película está llena de intensas persecuciones de autos, peleas y emocionantes escenas de acción. El grupo se enfrenta a un nuevo enemigo, pero también se une para salvar a uno de los suyos, llevando la acción a otro nivel.",
      "icono": "./public/peliculasImagenes/2.jpg",
      "video": "https://www.youtube.com/embed/yY6JUPCgDxU?si=yvQVF0FwySJVktAr",
      "categoria": "Accion"
    },
    {
      "id": 16,
      "titulo": "The Godfather",
      "fecha": "1972",
      "precio": 300,
      "description": "Una poderosa familia mafiosa enfrenta el cambio y la traición en su lucha por el poder.",
      "descriptionModal": "En el Nueva York de mediados del siglo XX, la familia Corleone lidera el mundo del crimen organizado bajo el mando del respetado y temido Don Vito Corleone. Cuando un intento de asesinato deja al patriarca debilitado, su hijo menor, Michael, se ve arrastrado al oscuro mundo que había intentado evitar. Mientras la familia se enfrenta a rivalidades violentas, traiciones y una guerra por el control del poder, Michael asume el rol de líder, sacrificando su moralidad y relaciones personales en el proceso. La transformación de Michael de un héroe de guerra idealista a un despiadado jefe de la mafia revela una compleja historia de lealtad, ambición y tragedia familiar.",
      "icono": "./public/peliculasImagenes/16.jpg",
      "video": "https://www.youtube.com/embed/sY1S34973zA?si=KG2hpZcM6Nz3cKa8",
      "categoria": "Crimen"
    },
    {
      "id": 17,
      "titulo": "The Dark Knight Rises",
      "fecha": "2012",
      "precio": 280,
      "description": "Batman enfrenta su mayor desafío al luchar contra Bane y salvar Gotham.",
      "descriptionModal": "Ocho años después de asumir la culpa por la muerte de Harvey Dent, Bruce Wayne vive recluido mientras Gotham disfruta de una paz temporal. Sin embargo, la aparición del imponente terrorista Bane pone a la ciudad al borde de la destrucción. Forzado a volver como Batman, Bruce enfrenta tanto el peso de su pasado como la amenaza de un enemigo formidable que desafía su fuerza física y mental. Con la ayuda de nuevos aliados como Selina Kyle y el fiel Alfred, Batman se embarca en una lucha épica que no solo define su destino, sino el futuro de Gotham. En una historia llena de sacrificios, redención y esperanza, Bruce Wayne demuestra que un héroe puede nacer incluso en la oscuridad más profunda.",
      "icono": "./public/peliculasImagenes/17.jpg",
      "video": "https://www.youtube.com/embed/GokKUqLcvD8?si=NLeLPXNW5CmSBm7G",
      "categoria": "Accion"
    },
    {
      "id": 18,
      "titulo": "Avatar",
      "fecha": "2009",
      "precio": 300,
      "description": "Un soldado parapléjico se une a un mundo alienígena y lucha por su supervivencia.",
      "descriptionModal": "En el exuberante planeta Pandora, el exmarine Jake Sully encuentra una nueva oportunidad de vida a través de un programa de transferencia de conciencia que lo conecta con un cuerpo alienígena. Mientras Jake se integra en la cultura de los Na'vi y se enamora de Neytiri, descubre los peligros que su propia especie representa para el frágil ecosistema y la forma de vida de Pandora. Dividido entre lealtades, Jake lidera una lucha por la supervivencia que combina épicas batallas y profundos lazos emocionales. A través de impresionantes visuales y una narrativa conmovedora, Avatar explora temas de colonización, conexión y el poder de la resistencia.",
      "icono": "./public/peliculasImagenes/18.jpg",
      "video": "https://www.youtube.com/embed/5PSNL1qE6VY?si=3OVF_qXIl8FoqAk9",
      "categoria": "Ciencia-ficcion"
    },
    {
      "id": 19,
      "titulo": "Frozen",
      "fecha": "2013",
      "precio": 220,
      "description": "Dos hermanas enfrentan el invierno eterno causado por poderes mágicos.",
      "descriptionModal": "En el reino de Arendelle, las hermanas Elsa y Anna comparten un vínculo especial hasta que los poderes mágicos de Elsa, capaces de crear hielo y nieve, se convierten en un peligro incontrolable. Forzada a aislarse para proteger a su hermana y su pueblo, Elsa huye al desatar accidentalmente un invierno eterno. Determinada a traerla de vuelta, Anna emprende un valiente viaje acompañado por un montañero llamado Kristoff, su fiel reno Sven y un alegre muñeco de nieve llamado Olaf. A través de canciones memorables y emocionantes aventuras, Frozen explora temas de amor fraternal, valentía y autoaceptación, mostrando que el verdadero amor no siempre es lo que uno espera.",
      "icono": "./public/peliculasImagenes/19.jpg",
      "video": "https://www.youtube.com/embed/TbQm5doF_Uc?si=pXewwSGEn-Q3Ggfg",
      "categoria": "Animacion"
    },
    {
      "id": 20,
      "titulo": "Harry Potter y la Piedra Filosofal",
      "fecha": "2001",
      "precio": 250,
      "description": "El joven Harry Potter descubre que es un mago y asiste a la escuela de magia Hogwarts.",
      "descriptionModal": "Es la primera entrega de la saga mágica basada en los libros de J.K. Rowling. El joven Harry Potter descubre que es un mago y, al cumplir 11 años, recibe una invitación para asistir a la escuela de magia Hogwarts. Allí, conoce a nuevos amigos y enfrenta misteriosos desafíos mientras trata de desvelar el secreto de la Piedra Filosofal, un artefacto mágico con poderes inmensos que podría cambiar su vida para siempre.",
      "icono": "./public/peliculasImagenes/1.jpg",
      "video": "https://www.youtube.com/embed/WE4AJuIvG1Y?si=DEDhmYFJiFD2FTiL",
      "categoria": "Fantasia"
    },


    
      {
        "id": 21,
        "titulo": "Schindler's List",
        "fecha": "1993",
        "precio": 350,
        "description": "Un empresario alemán salva a cientos de judíos durante el Holocausto.",
        "descriptionModal": "Ambientada durante el Holocausto, Schindler's List cuenta la conmovedora historia de Oskar Schindler, un empresario alemán miembro del partido nazi que, a lo largo de la Segunda Guerra Mundial, transforma su fábrica en un refugio para cientos de judíos perseguidos. Inicialmente motivado por intereses económicos, Schindler experimenta un cambio moral al presenciar las atrocidades cometidas contra el pueblo judío. Usando su ingenio y recursos, crea una lista de trabajadores esenciales que logra salvar más de mil vidas. A través de impactantes imágenes y una narrativa profundamente humana, esta película explora temas de sacrificio, redención y la capacidad del ser humano para el bien en medio del horror.",
        "icono": "./public/peliculasImagenes/21.jpg",
        "video": "https://www.youtube.com/embed/gG22XNhtnoY",
        "categoria": "Drama"
      },
      {
        "id": 22,
        "titulo": "12 Angry Men",
        "fecha": "1957",
        "precio": 200,
        "description": "Doce jurados debaten el destino de un joven acusado de asesinato.",
        "descriptionModal": "En un sofocante salón del jurado, doce hombres se enfrentan al desafío de decidir el destino de un joven acusado de asesinato, con su vida en juego. A medida que el debate avanza, inicialmente dominado por el prejuicio y la indiferencia, un solo jurado cuestiona las pruebas presentadas, sembrando dudas razonables entre sus compañeros. En este intenso drama de cámara, las tensiones se elevan mientras cada jurado confronta sus propias creencias, prejuicios y responsabilidades. 12 Angry Men es un retrato fascinante de la justicia, el conflicto humano y el poder de la persuasión razonada en la búsqueda de la verdad.",
        "icono": "./public/peliculasImagenes/22.jpg",
        "video": "https://www.youtube.com/embed/_13J_9B5jEk",
        "categoria": "Drama"
      },
      {
        "id": 23,
        "titulo": "The Green Mile",
        "fecha": "1999",
        "precio": 280,
        "description": "Un guardia de prisión descubre los dones sobrenaturales de un prisionero condenado.",
        "descriptionModal": "En una prisión de alta seguridad durante la Gran Depresión, Paul Edgecomb, jefe de los guardias del pasillo de la muerte, desarrolla una relación única con John Coffey, un recluso condenado por asesinato. A pesar de su imponente tamaño, Coffey demuestra ser un hombre amable y con un don sobrenatural para sanar. Mientras Paul y sus colegas lidian con los desafíos morales y emocionales de su trabajo, Coffey impacta profundamente sus vidas, obligándolos a cuestionar la justicia y la naturaleza del bien y el mal. The Green Mile es una conmovedora historia de compasión, milagros y la lucha por la humanidad en las circunstancias más oscuras.",
        "icono": "./public/peliculasImagenes/23.jpg",
        "video": "https://www.youtube.com/embed/Ki4haFrqSrw?si=Pfh7IrTwqqBV8ogX",
        "categoria": "Drama"
      },
      {
        "id": 24,
        "titulo": "The Prestige",
        "fecha": "2006",
        "precio": 250,
        "description": "Dos magos rivales compiten por el truco definitivo.",
        "descriptionModal": "En la Inglaterra victoriana, los magos Robert Angier y Alfred Borden comienzan como compañeros pero pronto se convierten en enemigos mortales tras un trágico accidente. En su obsesión por superar al otro, ambos desarrollan actos cada vez más complejos, utilizando secretos, sacrificios y engaños que afectan profundamente sus vidas y las de quienes los rodean. A medida que su rivalidad alcanza su clímax, se revelan oscuros misterios que redefinen su percepción de la realidad y el precio del éxito. The Prestige combina intriga, suspenso y giros impactantes en una historia que explora los límites de la ambición y la obsesión.",
        "icono": "./public/peliculasImagenes/24.jpg",
        "video": "https://www.youtube.com/embed/o4gHCmTQDVI",
        "categoria": "Drama"
      },
      {
        "id": 25,
        "titulo": "Memento",
        "fecha": "2000",
        "precio": 260,
        "description": "Un hombre con amnesia busca venganza por la muerte de su esposa.",
        "descriptionModal": "Leonard Shelby sufre de amnesia anterógrada, lo que le impide formar nuevos recuerdos, tras el brutal asesinato de su esposa. Confiando en notas, fotos Polaroid y tatuajes como recordatorios, Leonard intenta reconstruir los eventos que llevaron al crimen y encontrar al responsable. Sin embargo, su búsqueda se ve complicada por aliados cuestionables, confusiones en la línea del tiempo y la fragilidad de su propia percepción. Narrada de forma no lineal, Memento ofrece una experiencia cinematográfica única que desafía las ideas de memoria, identidad y justicia.",
        "icono": "./public/peliculasImagenes/25.jpg",
        "video": "https://www.youtube.com/embed/0vS0E9bBSL0",
        "categoria": "Terror"
      },
      {
        "id": 26,
        "titulo": "Fight Club",
        "fecha": "1999",
        "precio": 270,
        "description": "Un hombre insatisfecho funda un club de lucha clandestino.",
        "descriptionModal": "Un narrador anónimo atrapado en la monotonía de su vida corporativa encuentra un giro radical al conocer a Tyler Durden, un carismático vendedor de jabón con una filosofía de vida anarquista. Juntos, fundan el Fight Club, un espacio clandestino donde hombres descargan sus frustraciones a través de peleas físicas. Sin embargo, lo que comienza como un escape pronto se convierte en un movimiento radical fuera de control, desafiando las normas sociales y revelando verdades perturbadoras sobre la identidad y el propósito. Fight Club es una exploración visceral y provocadora de la alienación moderna y la rebelión contra la conformidad.",
        "icono": "./public/peliculasImagenes/26.jpg",
        "video": "https://www.youtube.com/embed/qtRKdVHc-cE",
        "categoria": "Drama"
      },
      {
        "id": 27,
        "titulo": "The Departed",
        "fecha": "2006",
        "precio": 290,
        "description": "Un policía encubierto y un topo en la mafia luchan por desenmascararse mutuamente.",
        "descriptionModal": "En Boston, la lucha entre la policía y el crimen organizado se intensifica cuando ambas facciones colocan infiltrados en el bando contrario. Billy Costigan, un policía encubierto, se infiltra en la organización criminal liderada por Frank Costello, mientras Colin Sullivan, un topo de la mafia, asciende en las filas de la policía. A medida que ambos intentan descubrir al otro, se desata un juego mortal de engaños y lealtades en un ambiente de tensión constante. The Departed es un thriller lleno de giros inesperados, explorando la moralidad y los sacrificios en una batalla por la verdad y la justicia.",
        "icono": "./public/peliculasImagenes/27.jpg",
        "video": "https://www.youtube.com/embed/auYbpnEwBBg",
        "categoria": "Crimen"
      },
      {
        "id": 28,
        "titulo": "Se7en",
        "fecha": "1995",
        "precio": 280,
        "description": "Dos detectives investigan asesinatos basados en los siete pecados capitales.",
        "descriptionModal": "En una ciudad sombría y decadente, los detectives Somerset, un veterano en busca de paz, y Mills, un impulsivo novato, se enfrentan a una serie de asesinatos que reflejan los siete pecados capitales. Cada escena del crimen los adentra en la mente de un asesino metódico y despiadado que busca exponer la corrupción y el pecado en la sociedad. Mientras el caso se vuelve más personal y emocionalmente agotador, los detectives descubren que las verdaderas intenciones del asesino son tan perturbadoras como los crímenes que comete. Se7en es un thriller oscuro y cautivador que explora la moralidad, el sacrificio y la justicia en un mundo quebrado.",
        "icono": "./public/peliculasImagenes/28.jpg",
        "video": "https://www.youtube.com/embed/znmZoVkCjpI",
        "categoria": "Terror"
      },
      {
        "id": 29,
        "titulo": "The Social Network",
        "fecha": "2010",
        "precio": 260,
        "description": "La historia de la creación de Facebook y las disputas que la rodearon.",
        "descriptionModal": "The Social Network narra los orígenes de Facebook, desde su concepción en los dormitorios de Harvard hasta convertirse en un fenómeno global. La película explora las dinámicas personales y legales que enfrentó su fundador, Mark Zuckerberg, incluyendo disputas de propiedad intelectual y amistades fracturadas. Con un guion ágil y actuaciones memorables, la historia revela cómo la ambición, la innovación y la traición pueden entrelazarse en la creación de un imperio digital. Más allá de su narrativa empresarial, The Social Network ofrece un retrato agudo de la sociedad moderna y las complejidades de la conectividad humana.",
        "icono": "./public/peliculasImagenes/29.jpg",
        "video": "https://www.youtube.com/embed/lB95KLmpLR4",
        "categoria": "Drama"
      },
      {
        "id": 30,
        "titulo": "The Revenant",
        "fecha": "2015",
        "precio": 320,
        "description": "Un explorador lucha por sobrevivir tras ser atacado por un oso y traicionado por su equipo.",
        "descriptionModal": "Inspirada en hechos reales, The Revenant narra la épica lucha por sobrevivir de Hugh Glass, un explorador en la frontera estadounidense del siglo XIX. Tras ser brutalmente atacado por un oso y abandonado por su equipo, Glass enfrenta condiciones extremas, hambre y el acecho constante de enemigos para buscar venganza contra quienes lo traicionaron. Con impresionantes paisajes naturales y una actuación desgarradora de Leonardo DiCaprio, la película explora temas de resiliencia, traición y la conexión humana con la naturaleza. Una obra visualmente impactante que captura la crudeza y la belleza de la supervivencia.",
        "icono": "./public/peliculasImagenes/30.jpg",
        "video": "https://www.youtube.com/embed/LoebZZ8K5N0",
        "categoria": "Aventura"
      },
      {
        "id": 31,
        "titulo": "La La Land",
        "fecha": "2016",
        "precio": 280,
        "description": "Un músico y una actriz persiguen sus sueños en Los Ángeles mientras se enamoran.",
        "descriptionModal": "La La Land es un vibrante homenaje a los musicales clásicos que sigue la historia de Sebastian, un pianista de jazz, y Mia, una aspirante a actriz, mientras navegan los desafíos de perseguir sus sueños en Los Ángeles. Su amor florece en medio de números musicales deslumbrantes, pero pronto enfrentan dilemas entre sus ambiciones personales y su relación. Con una dirección encantadora, canciones memorables y actuaciones apasionadas, La La Land captura la magia, las luchas y las decisiones difíciles de quienes aspiran a algo más grande. Es un relato atemporal sobre el amor, la pasión y el precio del éxito.",
        "icono": "./public/peliculasImagenes/31.webp",
        "video": "https://www.youtube.com/embed/0pdqf4P9MB8",
        "categoria": "Musical"
      },
      {
        "id": 32,
        "titulo": "Parasite",
        "fecha": "2019",
        "precio": 300,
        "description": "Una familia pobre se infiltra en la vida de una familia rica con consecuencias inesperadas.",
        "descriptionModal": "Ganadora del Oscar a Mejor Película, Parasite es una sátira social que explora las diferencias de clase a través de la historia de los Kim, una familia de bajos recursos que gradualmente se infiltra en la vida de los acomodados Park. Con astucia y mentiras, los Kim logran emplearse en la casa de los Park, pero las tensiones aumentan cuando un secreto oscuro amenaza con destruirlo todo. A través de una narrativa ingeniosa y giros sorprendentes, Parasite combina humor, drama y suspenso para ofrecer un retrato impactante de las desigualdades sociales y las complejidades de la condición humana.",
        "icono": "./public/peliculasImagenes/32.webp",
        "video": "https://www.youtube.com/embed/5xH0HfJHsaY",
        "categoria": "Drama"
      },
      {
        "id": 33,
        "titulo": "The Matrix Revolutions",
        "fecha": "2003",
        "precio": 240,
        "description": "La guerra entre los humanos y las máquinas llega a su clímax.",
        "descriptionModal": "En el capítulo final de la trilogía de Matrix, Neo, Trinity y Morpheus enfrentan el destino de la humanidad mientras la ciudad de Sion es atacada por un ejército de máquinas. Con el futuro del mundo colgando de un hilo, Neo se embarca en una última misión para confrontar al Agente Smith, cuyo poder se ha descontrolado incluso para las máquinas. The Matrix Revolutions es un cierre lleno de acción y efectos visuales espectaculares, explorando temas de sacrificio, esperanza y el significado de la elección en un mundo controlado por inteligencias artificiales.",
        "icono": "./public/peliculasImagenes/33.webp",
        "video": "https://www.youtube.com/embed/hMbexEPAOQI",
        "categoria": "Ciencia-Ficcion"
      },
      {
        "id": 34,
        "titulo": "The Wolf of Wall Street",
        "fecha": "2013",
        "precio": 310,
        "description": "La vida extravagante y los excesos de un corredor de bolsa de Nueva York.",
        "descriptionModal": "Basada en hechos reales, The Wolf of Wall Street sigue la vida de Jordan Belfort, un ambicioso corredor de bolsa que asciende rápidamente en el mundo financiero gracias a su astucia y métodos cuestionables. Rodeado de lujo, excesos y corrupción, Belfort crea un imperio que pronto comienza a desmoronarse bajo el peso de sus propias decisiones. Con una dirección magistral de Martin Scorsese y una actuación electrizante de Leonardo DiCaprio, la película ofrece una mirada fascinante y satírica sobre el poder, la avaricia y las consecuencias del desenfreno.",
        "icono": "./public/peliculasImagenes/34.jpg",
        "video": "https://www.youtube.com/embed/iszwuX1AK6A",
        "categoria": "Biografia"
      },
      {
        "id": 35,
        "titulo": "The Hangover",
        "fecha": "2009",
        "precio": 250,
        "description": "Tres amigos intentan reconstruir lo que ocurrió tras una noche descontrolada en Las Vegas.",
        "descriptionModal": "En esta comedia hilarante, tres amigos y el futuro novio viajan a Las Vegas para celebrar una despedida de soltero inolvidable. Sin embargo, cuando despiertan al día siguiente, no recuerdan nada de la noche anterior y el novio está desaparecido. En su intento por encontrarlo, los amigos descubren pistas absurdas y se enfrentan a situaciones descabelladas. The Hangover es una divertida odisea llena de sorpresas, bromas y momentos icónicos, mostrando cómo las mejores intenciones pueden salir completamente mal en la ciudad del pecado.",
        "icono": "./public/peliculasImagenes/35.jpg",
        "video": "https://www.youtube.com/embed/tcdUhdOlz9M",
        "categoria": "Comedia"
      },
      {
        "id": 36,
        "titulo": "Spider-Man: No Way Home",
        "fecha": "2021",
        "precio": 350,
        "description": "Peter Parker enfrenta las consecuencias de que su identidad sea revelada al mundo.",
        "descriptionModal": "En Spider-Man: No Way Home, Peter Parker enfrenta un caos tras ser desenmascarado como Spider-Man. Desesperado por recuperar su privacidad, acude a Doctor Strange en busca de ayuda, pero un hechizo mal ejecutado desata un multiverso de villanos de diferentes realidades. Con la ayuda de aliados inesperados, Peter debe enfrentar su mayor desafío hasta ahora y aprender el verdadero significado de ser un héroe. Esta épica aventura llena de acción, emoción y nostalgia redefine la saga del Hombre Araña, brindando momentos inolvidables a los fans de todas las generaciones.",
        "icono": "./public/peliculasImagenes/36.jpg",
        "video": "https://www.youtube.com/embed/JfVOs4VSpmA",
        "categoria": "Accion"
      },
      {
        "id": 37,
        "titulo": "The Irishman",
        "fecha": "2019",
        "precio": 330,
        "description": "Un sicario reflexiona sobre su vida y su relación con una figura del crimen organizado.",
        "descriptionModal": "Dirigida por Martin Scorsese, The Irishman cuenta la historia de Frank Sheeran, un veterano de guerra convertido en sicario para el sindicato criminal. A través de flashbacks, Frank narra su implicación en eventos históricos clave, incluyendo su relación con el poderoso líder sindical Jimmy Hoffa. La película explora la lealtad, el arrepentimiento y el paso del tiempo, mientras Frank enfrenta las consecuencias de sus decisiones en una vida marcada por la violencia. Con actuaciones magistrales de Robert De Niro, Al Pacino y Joe Pesci, The Irishman es una obra épica sobre el crimen y la redención.",
        "icono": "./public/peliculasImagenes/37.jpg",
        "video": "https://www.youtube.com/embed/WHXxVmeGQUc",
        "categoria": "Crimen"
      },
      {
        "id": 38,
        "titulo": "The Grand Budapest Hotel",
        "fecha": "2014",
        "precio": 260,
        "description": "Las aventuras de un conserje en un elegante hotel europeo durante la década de 1930.",
        "descriptionModal": "The Grand Budapest Hotel relata las hilarantes y encantadoras aventuras de Gustave H., el carismático conserje de un famoso hotel en una ficticia nación europea. Gustave hereda una valiosa pintura renacentista tras la muerte de una rica clienta, pero pronto se ve envuelto en una serie de intrigas, persecuciones y absurdos conflictos legales. A través de un diseño visual único y un elenco estelar, la película captura la esencia del estilo distintivo de Wes Anderson, combinando comedia, drama y nostalgia para ofrecer una experiencia cinematográfica verdaderamente encantadora.",
        "icono": "./public/peliculasImagenes/38.jpg",
        "video": "https://www.youtube.com/embed/1Fg5iWmQjwk",
        "categoria": "Comedia"
      },
      {
        "id": 39,
        "titulo": "Volver al Futuro",
        "fecha": "1985",
        "precio": 270,
        "description": "Un joven viaja al pasado y altera los eventos que conducen al matrimonio de sus padres.",
        "descriptionModal": "En Volver al Futuro, Marty McFly, un adolescente de los años 80, accidentalmente viaja al año 1955 gracias a una máquina del tiempo creada por el excéntrico científico Doc Brown. En el pasado, Marty interfiere involuntariamente en el primer encuentro entre sus futuros padres, poniendo en riesgo su propia existencia. Con la ayuda de un joven Doc Brown, Marty debe reparar la línea temporal, asegurarse de que sus padres se enamoren y encontrar una forma de regresar a su época. Esta película combina humor, acción y emoción en una aventura que ha dejado una huella imborrable en la historia del cine.",
        "icono": "./public/peliculasImagenes/39.jpg",
        "video": "https://www.youtube.com/embed/qvsgGtivCgs",
        "categoria": "Ciencia-Ficcion"
      },


        
      {
        "id": 40,
        "titulo": "Blade Runner 2049",
        "fecha": "2017",
        "precio": 320,
        "description": "Un blade runner descubre un secreto enterrado que podría alterar el equilibrio de la sociedad.",
        "descriptionModal": "En Blade Runner 2049, el agente K, un blade runner de la policía de Los Ángeles, desentierra un secreto largamente enterrado que amenaza con desmoronar lo que queda de la sociedad. Esta revelación lo lleva a buscar a Rick Deckard, un antiguo blade runner desaparecido por 30 años. En su viaje, K enfrenta dilemas éticos y morales mientras explora la naturaleza de la humanidad y la inteligencia artificial. Con una impresionante cinematografía y una narrativa profunda, esta película expande y redefine el universo creado por su predecesora.",
        "icono": "./public/peliculasImagenes/40.jpg",
        "video": "https://www.youtube.com/embed/gCcx85zbxz4",
        "categoria": "Ciencia-Ficcion"
      },
      {
        "id": 41,
        "titulo": "The Godfather Part II",
        "fecha": "1974",
        "precio": 350,
        "description": "Una exploración paralela del ascenso de Vito Corleone y la lucha de su hijo Michael por mantener el poder.",
        "descriptionModal": "The Godfather Part II narra la historia de Vito Corleone desde sus humildes comienzos en Sicilia hasta convertirse en un poderoso jefe de la mafia en Nueva York. Al mismo tiempo, sigue a su hijo Michael en los años 50 mientras intenta expandir y proteger el imperio familiar frente a traiciones internas y amenazas externas. Considerada una obra maestra, esta secuela y precuela profundiza en los temas de poder, familia y sacrificio que definieron a la primera entrega.",
        "icono": "./public/peliculasImagenes/41.jpg",
        "video": "https://www.youtube.com/embed/9O1Iy9od7-A",
        "categoria": "Drama"
      },
      {
        "id": 42,
        "titulo": "The Silence of the Lambs",
        "fecha": "1991",
        "precio": 280,
        "description": "Una joven agente del FBI busca la ayuda de un brillante pero peligroso asesino en serie.",
        "descriptionModal": "En The Silence of the Lambs, la agente del FBI Clarice Starling debe recurrir a Hannibal Lecter, un psiquiatra brillante y asesino en serie encarcelado, para obtener pistas sobre otro asesino apodado Buffalo Bill. Mientras Clarice profundiza en la mente de Lecter, enfrenta desafíos psicológicos que ponen a prueba su fortaleza emocional y profesional. Este thriller psicológico es conocido por sus actuaciones icónicas y su inquietante exploración de la mente humana.",
        "icono": "./public/peliculasImagenes/42.jpg",
        "video": "https://www.youtube.com/embed/W6Mm8Sbe__o",
        "categoria": "Terror"
      },
      {
        "id": 43,
        "titulo": "The Usual Suspects",
        "fecha": "1995",
        "precio": 260,
        "description": "Cinco criminales son interrogados tras un misterioso ataque en un barco.",
        "descriptionModal": "The Usual Suspects sigue a un grupo de delincuentes que se reúnen tras ser detenidos por un crimen que no cometieron. A medida que traman un elaborado plan para vengarse, una figura misteriosa conocida como Keyser Söze emerge como el verdadero cerebro detrás de los eventos. La película, narrada desde el punto de vista de un testigo poco confiable, ofrece giros sorprendentes y un clímax inolvidable que redefine todo lo que se había visto antes.",
        "icono": "./public/peliculasImagenes/43.jpg",
        "video": "https://www.youtube.com/embed/oiXdPolca5w",
        "categoria": "Suspenso"
      },
      {
        "id": 44,
        "titulo": "The Shining",
        "fecha": "1980",
        "precio": 280,
        "description": "Un hombre y su familia enfrentan el terror en un hotel aislado.",
        "descriptionModal": "En The Shining, Jack Torrance, un aspirante a escritor, acepta un trabajo como cuidador de invierno en el remoto Hotel Overlook, llevando consigo a su esposa e hijo. Sin embargo, fuerzas sobrenaturales comienzan a influir en Jack, llevándolo a la locura. Mientras tanto, su hijo Danny descubre oscuros secretos del hotel a través de su habilidad psíquica, conocida como 'el resplandor'. Esta obra maestra de Stanley Kubrick combina horror psicológico y visual en un relato inolvidable.",
        "icono": "./public/peliculasImagenes/44.jpg",
        "video": "https://www.youtube.com/embed/S014oGZiSdI",
        "categoria": "Terror"
      },
      {
        "id": 45,
        "titulo": "Hulk",
        "fecha": "2003",
        "precio": 220,
        "description": "Un científico se convierte en un monstruo verde gigante tras un experimento fallido.",
        "descriptionModal": "Hulk cuenta la historia del científico Bruce Banner, quien, tras un experimento que sale terriblemente mal, se transforma en un monstruo verde gigante cada vez que pierde el control de sus emociones. Mientras lucha por aceptar su nueva realidad, Bruce debe enfrentarse a aquellos que quieren explotar sus poderes para su propio beneficio. Con una combinación de acción intensa, dilemas emocionales y un trasfondo de ciencia ficción, esta película explora la dualidad entre el hombre y el monstruo.",
        "icono": "./public/peliculasImagenes/45.jpg",
        "video": "https://www.youtube.com/embed/xbqNb2PFKKA",
        "categoria": "Accion"
      },
      {
        "id": 46,
        "titulo": "The Big Lebowski",
        "fecha": "1998",
        "precio": 250,
        "description": "Un hombre conocido como 'The Dude' se ve envuelto en un extraño caso de identidad equivocada.",
        "descriptionModal": "The Big Lebowski sigue las desventuras de Jeff Lebowski, conocido simplemente como 'The Dude', un hombre relajado y amante de los bolos. Su vida da un giro inesperado cuando es confundido con un millonario del mismo nombre y se ve envuelto en un absurdo caso de secuestro y engaños. Con personajes excéntricos, diálogos memorables y un humor único, esta comedia de los hermanos Coen ha ganado un estatus de culto.",
        "icono": "./public/peliculasImagenes/46.jpg",
        "video": "https://www.youtube.com/embed/cd-go0oBF4Y",
        "categoria": "Comedia"
      },
      {
        "id": 47,
        "titulo": "The Breakfast Club",
        "fecha": "1985",
        "precio": 240,
        "description": "Cinco estudiantes con personalidades distintas pasan un sábado juntos en detención.",
        "descriptionModal": "The Breakfast Club reúne a cinco estudiantes de secundaria, cada uno representando un estereotipo diferente: el cerebrito, el atleta, la princesa, el criminal y la marginada. Obligados a pasar un sábado en detención, comienzan como extraños, pero a medida que comparten sus historias y luchas personales, se dan cuenta de que tienen más en común de lo que pensaban. Este clásico de los 80 es una reflexión sobre la adolescencia, la identidad y la conexión humana.",
        "icono": "./public/peliculasImagenes/47.jpg",
        "video": "https://www.youtube.com/embed/BSXBvor47Zs",
        "categoria": "Drama"
      },
      {
        "id": 48,
        "titulo": "American Beauty",
        "fecha": "1999",
        "precio": 300,
        "description": "Un hombre en crisis de mediana edad encuentra un nuevo propósito en la vida.",
        "descriptionModal": "En American Beauty, Lester Burnham, un hombre atrapado en una crisis de mediana edad, comienza a cuestionar su rutina y las expectativas de la sociedad. Su obsesión por una joven amiga de su hija lo impulsa a cambiar drásticamente su vida, renunciando a su trabajo y buscando la libertad personal. Mientras tanto, las dinámicas familiares y vecinales revelan oscuros secretos. Esta obra premiada es una crítica mordaz a la vida suburbana y una exploración de los deseos humanos.",
        "icono": "./public/peliculasImagenes/48.webp",
        "video": "https://www.youtube.com/embed/Ly7rq5EsTC8?si=XjQfAwiTLL5pqYvM",
        "categoria": "Drama"
      },
      {
        "id": 49,
        "titulo": "The Pianist",
        "fecha": "2002",
        "precio": 320,
        "description": "Un pianista judío lucha por sobrevivir durante la ocupación nazi en Varsovia.",
        "descriptionModal": "En The Pianist, Władysław Szpilman, un talentoso pianista judío-polaco, enfrenta las atrocidades de la Segunda Guerra Mundial tras la invasión nazi de Polonia. Mientras su familia es deportada a los campos de concentración, Szpilman logra escapar y se oculta en las ruinas de Varsovia, sobreviviendo gracias a su ingenio y la ayuda ocasional de otros. Esta película profundamente emotiva, basada en una historia real, es un poderoso testimonio de la resiliencia humana frente al horror.",
        "icono": "./public/peliculasImagenes/49.jpg",
        "video": "https://www.youtube.com/embed/BFwGqLa_oAo",
        "categoria": "Drama"
      },
                
      {
        "id": 50,
        "titulo": "La sospecha",
        "fecha": "1941",
        "precio": 250,
        "description": "Una mujer empieza a dudar de la fidelidad de su esposo en un thriller psicológico.",
        "descriptionModal": "En La sospecha, una joven mujer llamada Lina McLaidlaw comienza a sospechar que su esposo, Johnnie Aysgarth, podría estar involucrado en actividades criminales. A medida que la desconfianza crece, Lina se enfrenta a la angustia de no saber si está siendo manipulada por su marido o si realmente está en peligro. Dirigida por Alfred Hitchcock, esta película es un excelente ejemplo de suspenso y tensión psicológica.",
        "icono": "./public/peliculasImagenes/50.jpg",
        "video": "https://www.youtube.com/embed/P99iQMCI32U?si=In3Mahvqr0TvAgMb",
        "categoria": "Suspenso"
      },     
                
      {
        "id": 51,
        "titulo": "Goodfellas",
        "fecha": "1990",
        "precio": 300,
        "description": "La vida de un mafioso que asciende en el crimen organizado, pero paga un alto precio.",
        "descriptionModal": "Goodfellas cuenta la historia de Henry Hill, un joven que sueña con ser parte de la mafia y asciende rápidamente en las filas del crimen organizado. A medida que se sumerge más profundamente en un mundo de poder, violencia y traiciones, se enfrenta a las consecuencias devastadoras de su elección de vida. Con actuaciones memorables y una narrativa intensa, la película es una obra maestra que explora la gloria y la caída de un mafioso en el corazón del bajo mundo.",
        "icono": "./public/peliculasImagenes/51.png",
        "video": "https://www.youtube.com/embed/2ilzidi_J8Q",
        "categoria": "Crimen"
      },
      {
        "id": 52,
        "titulo": "Gone with the Wind",
        "fecha": "1939",
        "precio": 350,
        "description": "Una historia de amor y supervivencia ambientada en la Guerra Civil estadounidense.",
        "descriptionModal": "Gone with the Wind es un clásico del cine que sigue la vida de Scarlett O'Hara, una mujer fuerte y decidida que lucha por sobrevivir durante la devastación de la Guerra Civil estadounidense y la reconstrucción que le sigue. Con una historia de amor compleja y escenarios épicos, la película explora temas de pasión, sacrificio y la lucha por adaptarse en tiempos de cambio.",
        "icono": "./public/peliculasImagenes/52.jpg",
        "video": "https://www.youtube.com/embed/0dTsfsr6-X8",
        "categoria": "Drama"
      },
      {
        "id": 53,
        "titulo": "Casablanca",
        "fecha": "1942",
        "precio": 320,
        "description": "Un romance inolvidable en medio de la Segunda Guerra Mundial.",
        "descriptionModal": "Casablanca narra la historia de Rick Blaine, un cínico propietario de un club nocturno en Marruecos que se encuentra con su antiguo amor, Ilsa Lund, durante la Segunda Guerra Mundial. En un escenario de tensión política y dilemas morales, Rick debe decidir entre su amor por Ilsa y ayudarla a escapar junto a su esposo, un líder de la resistencia, para continuar luchando contra los nazis. Es una historia inolvidable de sacrificio y redención.",
        "icono": "./public/peliculasImagenes/53.jpg",
        "video": "https://www.youtube.com/embed/BkL9l7qovsE",
        "categoria": "Romance"
      },
      {
        "id": 54,
        "titulo": "Citizen Kane",
        "fecha": "1941",
        "precio": 300,
        "description": "La vida y legado de un magnate de los medios de comunicación.",
        "descriptionModal": "Citizen Kane es un retrato fascinante de la vida de Charles Foster Kane, un magnate de los medios cuya muerte despierta el misterio de su última palabra: 'Rosebud'. A través de una serie de flashbacks y entrevistas con quienes lo conocieron, la película explora los logros, fracasos y contradicciones de un hombre que lo tenía todo, pero cuya búsqueda de poder y amor lo dejó vacío.",
        "icono": "./public/peliculasImagenes/54.jpg",
        "video": "https://www.youtube.com/embed/8dxh3lwdOFw",
        "categoria": "Drama"
      },
      {
        "id": 55,
        "titulo": "Schindler's List",
        "fecha": "1993",
        "precio": 350,
        "description": "La historia de un empresario que salva a más de mil judíos durante el Holocausto.",
        "descriptionModal": "Schindler's List narra la historia real de Oskar Schindler, un empresario alemán que, al presenciar los horrores del Holocausto, utiliza su fábrica como refugio para salvar a más de mil judíos de los campos de concentración nazis. Con una narración profundamente conmovedora y actuaciones memorables, la película es un testimonio del impacto que un individuo puede tener frente a la adversidad y la injusticia.",
        "icono": "./public/peliculasImagenes/55.jpg",
        "video": "https://www.youtube.com/embed/gG22XNhtnoY",
        "categoria": "Biografia"
      },
      {
        "id": 56,
        "titulo": "The Lord of the Rings",
        "fecha": "2003",
        "precio": 400,
        "description": "La batalla final por la Tierra Media y el destino del Anillo Único.",
        "descriptionModal": "En The Return of the King, la última entrega de la trilogía, los miembros de la Comunidad del Anillo enfrentan sus pruebas más difíciles mientras Frodo y Sam se acercan al Monte del Destino para destruir el Anillo Único. Con batallas épicas, sacrificios heroicos y una narrativa que culmina en un final inolvidable, esta película es un testimonio del poder de la amistad, la valentía y la esperanza frente a la oscuridad.",
        "icono": "./public/peliculasImagenes/56.jpg",
        "video": "https://www.youtube.com/embed/r5X-hFf6Bwo",
        "categoria": "Fantasia"
      },
      {
        "id": 57,
        "titulo": "No Country for Old Men",
        "fecha": "2007",
        "precio": 280,
        "description": "Un juego mortal de cazador y presa en el desierto de Texas.",
        "descriptionModal": "No Country for Old Men sigue a Llewelyn Moss, un hombre que encuentra una maleta llena de dinero tras un negocio de drogas que sale mal. Su decisión de quedarse con el dinero lo pone en la mira de Anton Chigurh, un asesino implacable, y de un sheriff local que intenta evitar el derramamiento de sangre. Con una narrativa tensa y actuaciones impactantes, la película es un thriller que explora la violencia, el destino y la naturaleza del mal.",
        "icono": "./public/peliculasImagenes/57.jpg",
        "video": "https://www.youtube.com/embed/38A__WT3-o0",
        "categoria": "Crimen"
      },
      {
        "id": 58,
        "titulo": "Blade Runner",
        "fecha": "1982",
        "precio": 270,
        "description": "Un cazador de replicantes busca a androides rebeldes en un futuro distópico.",
        "descriptionModal": "Blade Runner, ambientada en un futuro distópico, sigue a Rick Deckard, un cazador de replicantes encargado de eliminar a androides que se han rebelado contra sus creadores. Mientras rastrea a los replicantes, Deckard se enfrenta a cuestiones éticas y filosóficas sobre lo que significa ser humano. Con una estética visual impresionante y un guion que invita a la reflexión, la película es un clásico de la ciencia ficción.",
        "icono": "./public/peliculasImagenes/58.jpg",
        "video": "https://www.youtube.com/embed/eogpIG53Cis",
        "categoria": "Ciencia-Ficcion"
      },

      {
        "id": 59,
        "titulo": "The Great Gatsby",
        "fecha": "2013",
        "precio": 300,
        "description": "Un hombre misterioso busca reencontrarse con su amor perdido durante los años 20.",
        "descriptionModal": "En The Great Gatsby, un hombre llamado Jay Gatsby organiza fiestas lujosas con la esperanza de reconquistar a Daisy Buchanan, su amor perdido. A través de los ojos de Nick Carraway, un vecino de Gatsby, vemos la lucha entre el amor y la obsesión, y cómo la búsqueda de la felicidad puede llevar a la tragedia. Ambientada en la era del jazz, la película explora los temas de la riqueza, la ambición y los sueños rotos.",
        "icono": "./public/peliculasImagenes/59.jpg",
        "video": "https://www.youtube.com/embed/rARN6agiW7o?si=DzqgVv6m2DqOrvG1",
        "categoria": "Drama"
      },
      {
        "id": 60,
        "titulo": "The King’s Speech",
        "fecha": "2010",
        "precio": 320,
        "description": "Un rey supera sus miedos y complejos para liderar a su nación en tiempos de guerra.",
        "descriptionModal": "En The King’s Speech, el rey Jorge VI de Inglaterra lucha contra un problema de tartamudeo mientras se prepara para liderar su país durante la Segunda Guerra Mundial. Con la ayuda de un terapeuta poco convencional, el monarca enfrenta sus inseguridades y encuentra su voz. La película es una emotiva historia de superación personal y del poder del liderazgo.",
        "icono": "./public/peliculasImagenes/60.jpg",
        "video": "https://www.youtube.com/embed/gSw6ei5tdbg?si=cTGj8Wh6dCAbJep3",
        "categoria": "Drama"
      },
      {
        "id": 61,
        "titulo": "The Truman Show",
        "fecha": "1998",
        "precio": 280,
        "description": "Un hombre descubre que toda su vida es un espectáculo televisivo, pero no sabe que está siendo observado.",
        "descriptionModal": "The Truman Show sigue la vida de Truman Burbank, un hombre que vive en un mundo perfecto pero pronto descubre que su vida es un programa de televisión seguido por millones de espectadores. La película examina temas como la privacidad, la libertad y la manipulación de los medios, con una reflexión profunda sobre la realidad y la percepción.",
        "icono": "./public/peliculasImagenes/61.webp",
        "video": "https://www.youtube.com/embed/dlnmQbPGuls?si=wf0o9S9MJXqLbvsA",
        "categoria": "Ciencia-Ficcion"
      },
      {
        "id": 62,
        "titulo": "Good Will Hunting",
        "fecha": "1997",
        "precio": 250,
        "description": "Un joven prodigio se enfrenta a su pasado y descubre su verdadero potencial.",
        "descriptionModal": "Good Will Hunting cuenta la historia de Will Hunting, un joven genio de los matemáticas que trabaja como conserje en el MIT. Después de ser arrestado, Will recibe ayuda de un terapeuta para superar sus problemas emocionales y enfrentar su talento. La película es una conmovedora reflexión sobre la autoaceptación, el amor y el crecimiento personal.",
        "icono": "./public/peliculasImagenes/62.jpg",
        "video": "https://www.youtube.com/embed/PaZVjZEFkRs",
        "categoria": "Drama"
      },
      {
        "id": 63,
        "titulo": "Sexto sentido",
        "fecha": "1999",
        "precio": 270,
        "description": "Un niño con habilidades sobrenaturales busca descubrir la verdad detrás de sus visiones.",
        "descriptionModal": "The Sixth Sense cuenta la historia de un niño llamado Cole que tiene la habilidad de ver personas muertas. Con la ayuda de un terapeuta, Cole trata de entender y controlar su don. La película es famosa por su giro final y por su exploración profunda del miedo, la culpa y la redención.",
        "icono": "./public/peliculasImagenes/63.webp",
        "video": "https://www.youtube.com/embed/zfOdk9JDzSw?si=y5pyzv_6rICKi-HE",
        "categoria": "Suspenso"
      },
      {
        "id": 64,
        "titulo": "The Terminator",
        "fecha": "1984",
        "precio": 300,
        "description": "Un hombre es enviado al pasado para evitar un apocalipsis que acabará con la humanidad.",
        "descriptionModal": "The Terminator es una película de ciencia ficción en la que un cyborg es enviado del futuro para matar a Sarah Connor, cuya descendencia es clave para la supervivencia de la humanidad. Con efectos especiales innovadores para su época y un guion lleno de acción y suspenso, la película se convirtió en un clásico y dio lugar a varias secuelas.",
        "icono": "./public/peliculasImagenes/64.jpg",
        "video": "https://www.youtube.com/embed/k64P4l2Wmeg?si=6EtrL_9AFAMySCfv",
        "categoria": "Accion"
      },
      {
        "id": 65,
        "titulo": "Whiplash",
        "fecha": "2014",
        "precio": 350,
        "description": "Un joven baterista busca la perfección bajo la intensa supervisión de un director implacable.",
        "descriptionModal": "Whiplash cuenta la historia de Andrew, un joven baterista de jazz que se enfrenta a la brutal disciplina de su maestro, Fletcher, en una escuela de música de élite. La película explora los límites del sacrificio, la ambición y la perfección, y examina cómo los sueños pueden empujarnos al borde de nuestras capacidades mentales y físicas.",
        "icono": "./public/peliculasImagenes/65.jpg",
        "video": "https://www.youtube.com/embed/7d_jQycdQGo",
        "categoria": "Drama"
      },
      {
        "id": 66,
        "titulo": "Mad Max: Fury Road",
        "fecha": "2015",
        "precio": 380,
        "description": "Un hombre lucha por su supervivencia en un desierto post-apocalíptico mientras enfrenta a un dictador tiránico.",
        "descriptionModal": "Mad Max: Fury Road es una película de acción y aventura que sigue a Max, un hombre atrapado en un mundo post-apocalíptico dominado por la guerra y la tiranía. Junto a Furiosa, una mujer rebelde, Max se enfrenta a un despiadado líder mientras luchan por la supervivencia en un paisaje desolado. La película es un viaje frenético de acción y emoción.",
        "icono": "./public/peliculasImagenes/66.jpg",
        "video": "https://www.youtube.com/embed/hEJnMQG9ev8",
        "categoria": "Accion"
      },
      {
        "id": 67,
        "titulo": "Django Unchained",
        "fecha": "2012",
        "precio": 330,
        "description": "Un hombre en busca de justicia se embarca en un viaje para liberar a una mujer esclavizada por un hombre brutal.",
        "descriptionModal": "Django Unchained cuenta la historia de Django, un esclavo liberado que, junto a un cazador de recompensas alemán, busca rescatar a su esposa de las garras de un cruel terrateniente. La película, dirigida por Quentin Tarantino, es una mezcla de western y drama, conocida por sus diálogos agudos, violencia estilizada y profundas reflexiones sobre la libertad y la justicia.",
        "icono": "./public/peliculasImagenes/67.jpg",
        "video": "https://www.youtube.com/embed/CLofzNkIqAc?si=byTqrmes76MiFYOf",
        "categoria": "Biografia"
      },
      {
        "id": 68,
        "titulo": "Gravity",
        "fecha": "2013",
        "precio": 340,
        "description": "Dos astronautas quedan varados en el espacio y deben luchar por su supervivencia mientras enfrentan la soledad y el peligro.",
        "descriptionModal": "Gravity cuenta la historia de dos astronautas que quedan atrapados en el espacio después de que su nave se destruye. Con pocas opciones de supervivencia y enfrentando los límites de la resistencia humana, la película sigue su lucha por regresar a la Tierra. Con una impresionante dirección y efectos visuales, Gravity explora la resiliencia humana ante lo imposible.",
        "icono": "./public/peliculasImagenes/68.jpg",
        "video": "https://www.youtube.com/embed/MEZWseaoZc8?si=jvrrPYGA3EjbaHYC",
        "categoria": "Ciencia-Ficcion"
      },
      {
        "id": 69,
        "titulo": "Alice in Wonderland",
        "fecha": "2010",
        "precio": 280,
        "description": "Alice regresa al País de las Maravillas para ayudar a derrotar a la Reina Roja y restaurar el equilibrio.",
        "descriptionModal": "Alice in Wonderland sigue a una joven llamada Alice que regresa al País de las Maravillas, un mundo surrealista y mágico, para cumplir con su destino y derrotar a la malvada Reina Roja. A medida que se adentra en este extraño lugar, Alice se encuentra con personajes únicos, como el Conejo Blanco, el Sombrerero Loco y la Reina Blanca. Con una estética visual deslumbrante y una historia que mezcla fantasía y aventuras, la película es una reinvención moderna del clásico de Lewis Carroll.",
        "icono": "./public/peliculasImagenes/69.jpg",
        "video": "https://www.youtube.com/embed/9POCgSRVvf0?si=rEVv8y2SwedbjsDw",
        "categoria": "Aventura"
      },
      {
        "id": 70,
        "titulo": "The Hateful Eight",
        "fecha": "2015",
        "precio": 320,
        "description": "Ocho desconocidos se enfrentan a un conflicto mortal durante una tormenta de nieve en el oeste estadounidense.",
        "descriptionModal": "The Hateful Eight sigue a ocho personajes que se encuentran atrapados en una estación de diligencias durante una tormenta de nieve. A medida que surgen tensiones y secretos, la desconfianza se apodera del grupo y la violencia parece inevitable. Dirigida por Quentin Tarantino, la película es un western cargado de suspenso, diálogos agudos y giros inesperados.",
        "icono": "./public/peliculasImagenes/70.jpg",
        "video": "https://www.youtube.com/embed/nIOmotayDMY?si=RLznWqrfj6lDyJ3x",
        "categoria": "Accion"
      },
      {
        "id": 71,
        "titulo": "La Bestia Oculta",
        "fecha": "2023",
        "precio": 320,
        "description": "Un grupo de jóvenes enfrenta sus miedos cuando se adentran en un bosque donde se oculta una criatura mortal.",
        "descriptionModal": "En La Bestia Oculta, un grupo de amigos decide aventurarse en un bosque remoto donde, según las leyendas locales, habita una criatura aterradora. A medida que se adentran en el bosque, empiezan a ser perseguidos por una fuerza invisible que parece tener la capacidad de manifestarse en sus miedos más profundos. A lo largo de la película, los personajes luchan no solo por sobrevivir a la criatura, sino por enfrentar sus propios traumas y miedos internos que se desatan en el aislamiento. La tensión crece hasta llegar a un giro inesperado que pone a prueba su cordura.",
        "icono": "./public/peliculasImagenes/71.jpg",
        "video": "https://www.youtube.com/embed/Hex8vyOCZqg?si=OwBUQHUb2EYDqN3K",
        "categoria": "Terror"
      },
      {
        "id": 72,
        "titulo": "Intensamente 2",
        "fecha": "2024",
        "precio": 310,
        "description": "Las emociones de una adolescente deben adaptarse a los nuevos desafíos de la vida mientras atraviesa la pubertad.",
        "descriptionModal": "En Intensamente 2, Riley, la joven protagonista de la primera película, está ahora en plena adolescencia, enfrentando las dificultades emocionales de la pubertad. Las emociones, lideradas por Alegría, Tristeza, Miedo, Ira y Desagrado, deben aprender a manejar los nuevos retos y cambios en la vida de Riley mientras ella navega por las complejidades de la adolescencia. La película explora la evolución emocional de los adolescentes y cómo las emociones siguen evolucionando junto con ellos.",
        "icono": "./public/peliculasImagenes/72.jpg",
        "video": "https://www.youtube.com/embed/xiC2iXTXHxw?si=s4weawipt5ukI8Ap",
        "categoria": "Animacion"
      },
        
        {
          "id": 73,
          "titulo": "Up",
          "fecha": "2009",
          "precio": 270,
          "description": "Un anciano y un joven explorador embarcan en una aventura en una casa flotante hacia América del Sur.",
          "descriptionModal": "Up cuenta la historia de Carl Fredricksen, un hombre viudo que cumple el sueño de su difunta esposa al viajar hacia las Cataratas del Paraíso en América del Sur, llevando con él su casa flotante atada a miles de globos. En el camino, se une a un joven explorador llamado Russell, y juntos viven una aventura que redefine lo que significa perseguir los sueños y encontrar nuevas amistades.",
          "icono": "./public/peliculasImagenes/73.jpg",
          "video": "https://www.youtube.com/embed/qoZo9MiICo0?si=LlRVu7n9qbv-ers0",
          "categoria": "Animacion"
        },
        {
          "id": 74,
          "titulo": "Toy Story 3",
          "fecha": "2010",
          "precio": 280,
          "description": "Los juguetes de Andy enfrentan su destino cuando su dueño se prepara para ir a la universidad.",
          "descriptionModal": "Toy Story 3 sigue a Woody, Buzz y los demás juguetes de Andy, que se enfrentan a su mayor desafío cuando su dueño se prepara para ir a la universidad. Al ser accidentalmente donados a una guardería, los juguetes deben encontrar una forma de regresar a casa, enfrentándose a nuevos peligros y retos. La película explora la temática del crecimiento, el cambio y la importancia de la amistad.",
          "icono": "./public/peliculasImagenes/74.jpg",
          "video": "https://www.youtube.com/embed/s73x_Hio_0w?si=iXzh9BWk7YYiLsPb",
          "categoria": "Animacion"
        },
        {
          "id": 75,
          "titulo": "Zootopia",
          "fecha": "2016",
          "precio": 260,
          "description": "Una coneja policía y un zorro estafador trabajan juntos para resolver un misterioso caso en una ciudad habitada por animales.",
          "descriptionModal": "Zootopia sigue a Judy Hopps, la primera coneja policía en la ciudad de Zootopia, que se asocia con un astuto zorro llamado Nick Wilde para resolver el misterio de la desaparición de varios animales. A través de su investigación, descubren una conspiración mayor y aprenden importantes lecciones sobre la tolerancia, los prejuicios y la colaboración.",
          "icono": "./public/peliculasImagenes/75.jpg",
          "video": "https://www.youtube.com/embed/jWM0ct-OLsM",
          "categoria": "Animacion"
        },
        {
          "id": 76,
          "titulo": "Soul",
          "fecha": "2020",
          "precio": 310,
          "description": "Un músico de jazz busca su propósito en la vida mientras explora el más allá.",
          "descriptionModal": "Soul sigue a Joe Gardner, un músico de jazz que, después de un accidente, se encuentra en el más allá. Mientras trata de regresar a su vida, Joe aprende sobre la importancia de disfrutar el presente y comprender su propósito en la vida. La película explora temas de la pasión, el sentido de la vida y la conexión entre las almas.",
          "icono": "./public/peliculasImagenes/76.jpg",
          "video": "https://www.youtube.com/embed/3QIdlo4uIVg?si=2aU8aF_A-MemFO-e",
          "categoria": "Animacion"
        },
        {
          "id": 77,
          "titulo": "Luca",
          "fecha": "2021",
          "precio": 230,
          "description": "Un joven monstruo marino descubre la vida en la superficie y forma una amistad que cambia su vida.",
          "descriptionModal": "Luca sigue a un joven monstruo marino que, durante un verano en la Riviera italiana, descubre la vida en la superficie y forma una amistad con un chico llamado Alberto. Juntos, viven aventuras y aprenden a enfrentar sus miedos, explorando temas de identidad, aceptación y la importancia de seguir los propios sueños.",
          "icono": "./public/peliculasImagenes/77.jpg",
          "video": "https://www.youtube.com/embed/kw50vQA1S-o?si=kVHzSrK4JVpTXSX2",
          "categoria": "Animacion"
        },
        {
          "id": 78,
          "titulo": "El Cuervo",
          "fecha": "2024",
          "precio": 320,
          "description": "Un espíritu vengativo regresa para atormentar a quienes cometieron crímenes atroces en una ciudad llena de secretos oscuros.",
          "descriptionModal": "En esta reinterpretación de *El Cuervo*, un espíritu vengativo resucita cada noche en busca de justicia por los crímenes que quedaron impunes. Ambientada en una ciudad opresiva y llena de secretos, la película sigue a un grupo de personas conectadas por un acto oscuro que desató la ira del espíritu. Con elementos de horror psicológico y escenas llenas de tensión, esta versión de *El Cuervo* combina el terror moderno con el misterio clásico, explorando temas de culpa, redención y el costo de las decisiones pasadas.",
          "icono": "./public/peliculasImagenes/78.jpg",
          "video": "https://www.youtube.com/embed/nuJsaUQ1GjE?si=QnrAD2Np_27c7ve7",
          "categoria": "Terror"
        },
        {
          "id": 79,
          "titulo": "Buscando a Nemo",
          "fecha": "2003",
          "precio": 220,
          "description": "Un pez payaso cruza el océano en busca de su hijo perdido.",
          "descriptionModal": "Finding Nemo cuenta la historia de Marlin, un pez payaso que viaja a través del océano para encontrar a su hijo Nemo, quien ha sido capturado por un buzo. Con la ayuda de Dory, una pez olvidadiza, Marlin enfrenta desafíos y aprende importantes lecciones sobre la vida, el valor y la superación personal mientras busca a su hijo.",
          "icono": "./public/peliculasImagenes/79.jpg",
          "video": "https://www.youtube.com/embed/ba4TwyaNhSQ?si=aHlnCRdO3dSuVI4i",
          "categoria": "Animacion"
        },
        {
          "id": 80,
          "titulo": "Moana",
          "fecha": "2016",
          "precio": 230,
          "description": "Una joven aventurera emprende un viaje épico para salvar su isla con la ayuda de un semidiós.",
          "descriptionModal": "Moana cuenta la historia de una valiente joven que siente una conexión especial con el océano. Desafiando las tradiciones de su tribu, se embarca en una audaz travesía para salvar su isla de una oscura amenaza. Durante su aventura, Moana forma equipo con el semidiós Maui, enfrentándose a monstruos marinos y desafiando sus propios límites. Con música vibrante, paisajes deslumbrantes y un mensaje de empoderamiento, esta película es un tributo a la conexión entre la humanidad y la naturaleza.",
          "icono": "./public/peliculasImagenes/80.webp",
          "video": "https://www.youtube.com/embed/LKFuXETZUsI",
          "categoria": "Animacion"
        },
        {
          "id": 81,
          "titulo": "Big Hero 6",
          "fecha": "2014",
          "precio": 240,
          "description": "Un joven inventor y su robot intentan desentrañar un misterio en su ciudad.",
          "descriptionModal": "Big Hero 6 sigue la historia de Hiro, un prodigioso inventor que junto con su adorable robot Baymax forma un grupo de héroes para combatir una amenaza en su ciudad futurista. Con una mezcla de tecnología avanzada, humor y acción, esta película destaca la importancia de la familia y la amistad, mientras Hiro aprende a superar su pérdida personal y a confiar en sus nuevos amigos.",
          "icono": "./public/peliculasImagenes/81.jpg",
          "video": "https://www.youtube.com/embed/z3biFxZIJOQ",
          "categoria": "Animacion"
        },
        {
          "id": 82,
          "titulo": "Frozen II",
          "fecha": "2019",
          "precio": 250,
          "description": "Elsa y Anna exploran los orígenes de sus poderes en una aventura épica.",
          "descriptionModal": "En Frozen II, Elsa y Anna se embarcan en un peligroso viaje hacia el norte para descubrir los secretos del pasado de su reino y el origen de los poderes de Elsa. Junto a Kristoff, Sven y Olaf, las hermanas enfrentan desafíos sobrenaturales y toman decisiones que cambiarán el destino de Arendelle. Con canciones inolvidables y espectaculares paisajes animados, esta película es una historia de amor, sacrificio y autodescubrimiento.",
          "icono": "./public/peliculasImagenes/82.jpg",
          "video": "https://www.youtube.com/embed/Zi4LMpSDccc",
          "categoria": "Animacion"
        },
        {
          "id": 83,
          "titulo": "Wall-E",
          "fecha": "2008",
          "precio": 260,
          "description": "Un robot solitario en la Tierra descubre el amor y un propósito mayor en el espacio.",
          "descriptionModal": "Wall-E es la historia de un robot recolector de basura que vive en una Tierra desolada y contaminada. Su vida cambia cuando conoce a Eve, una moderna robot enviada para buscar señales de vida. Juntos, Wall-E y Eve se embarcan en una aventura espacial que redefine el futuro de la humanidad. Con un poderoso mensaje ecológico y una emotiva historia de amor, esta película es un hito en la animación.",
          "icono": "./public/peliculasImagenes/83.jpg",
          "video": "https://www.youtube.com/embed/CZ1CATNbXg0",
          "categoria": "Animacion"
        },
        {
          "id": 84,
          "titulo": "Inside Man",
          "fecha": "2006",
          "precio": 290,
          "description": "Un ladrón inteligente desafía a la policía en un elaborado robo a un banco.",
          "descriptionModal": "Inside Man es un emocionante thriller que sigue a un astuto ladrón de bancos que lleva a cabo el atraco perfecto mientras juega al gato y al ratón con la policía. Con giros inesperados y un elenco impresionante, la película explora temas de moralidad, justicia y engaño. Su trama cuidadosamente construida mantiene a la audiencia al borde de su asiento hasta el sorprendente desenlace.",
          "icono": "./public/peliculasImagenes/84.jpg",
          "video": "https://www.youtube.com/embed/EvqJ7slnbxM?si=90F0G3Hgy3tV2b4j",
          "categoria": "Crimen"
        },
        {
          "id": 85,
          "titulo": "Black Panther",
          "fecha": "2018",
          "precio": 300,
          "description": "T'Challa debe defender su trono como rey y héroe de Wakanda.",
          "descriptionModal": "Black Panther narra la historia de T'Challa, el recién coronado rey de Wakanda, una nación tecnológicamente avanzada pero oculta al mundo. Al enfrentarse a un poderoso enemigo, T'Challa debe unir a su pueblo y abrazar su papel como Pantera Negra. Con una rica narrativa cultural y visualmente impresionante, esta película es un hito en el cine de superhéroes.",
          "icono": "./public/peliculasImagenes/85.jpg",
          "video": "https://www.youtube.com/embed/xjDjIWPwcPU",
          "categoria": "Acción"
        },
        {
          "id": 86,
          "titulo": "Doctor Strange",
          "fecha": "2016",
          "precio": 280,
          "description": "Un cirujano descubre un mundo de magia y dimensiones alternativas.",
          "descriptionModal": "Doctor Strange cuenta la historia de Stephen Strange, un brillante pero arrogante neurocirujano cuya vida cambia tras un accidente que daña sus manos. Buscando curación, viaja al Himalaya, donde descubre un mundo de magia y dimensiones alternativas. A medida que entrena, Strange se enfrenta a amenazas cósmicas que lo convierten en un defensor de la Tierra contra fuerzas místicas.",
          "icono": "./public/peliculasImagenes/86.jpg",
          "video": "https://www.youtube.com/embed/HSzx-zryEgM",
          "categoria": "Acción"
        },
        {
          "id": 87,
          "titulo": "Captain Marvel",
          "fecha": "2019",
          "precio": 270,
          "description": "Una heroína descubre su pasado mientras lucha para proteger la galaxia.",
          "descriptionModal": "Captain Marvel sigue a Carol Danvers mientras se convierte en una de las heroínas más poderosas del universo. Al recuperar recuerdos de su vida pasada, se da cuenta de su verdadera identidad y enfrenta una guerra intergaláctica. Con impresionantes efectos visuales y una narrativa de empoderamiento, la película es una emocionante adición al Universo Cinematográfico de Marvel.",
          "icono": "./public/peliculasImagenes/87.jpg",
          "video": "https://www.youtube.com/embed/Z1BCujX3pw8",
          "categoria": "Acción"
        },
        {
          "id": 88,
          "titulo": "Shrek",
          "fecha": "2001",
          "precio": 250,
          "description": "Un ogro se embarca en una misión para rescatar a una princesa con un burro parlante.",
          "descriptionModal": "Shrek es la historia de un ogro gruñón que, para recuperar su pantano, se ve obligado a rescatar a la princesa Fiona. Acompañado por un hilarante burro parlante, Shrek descubre que las apariencias engañan y que el amor verdadero trasciende todas las barreras. Con humor y corazón, esta película redefinió el género de cuentos de hadas animados.",
          "icono": "./public/peliculasImagenes/88.webp",
          "video": "https://www.youtube.com/embed/CwXOrWvPBPk",
          "categoria": "Animacion"
        },
        {
          "id": 89,
          "titulo": "Shrek 2",
          "fecha": "2004",
          "precio": 250,
          "description": "Shrek y Fiona conocen a los padres de Fiona mientras enfrentan nuevos desafíos.",
          "descriptionModal": "Shrek 2 continúa la historia del ogro Shrek y la princesa Fiona tras su boda. Al conocer a los padres de Fiona, enfrentan desafíos inesperados, incluidos los planes del Hada Madrina y el Príncipe Encantador. Con personajes nuevos e hilarantes, la película mantiene el humor y el corazón que hicieron del original un clásico.",
          "icono": "./public/peliculasImagenes/89.jpg",
          "video": "https://www.youtube.com/embed/xBxVgh-kgAI?si=BQYvnsCUVGM7I_SA",
          "categoria": "Animacion"
        },
        {
          "id": 90,
          "titulo": "Shrek Tercero",
          "fecha": "2007",
          "precio": 240,
          "description": "Shrek busca a un heredero adecuado para el trono mientras enfrenta nuevos retos familiares.",
          "descriptionModal": "En Shrek Tercero, el ogro verde se enfrenta a la responsabilidad de ser rey y a los desafíos familiares que surgen cuando su suegro, el rey Harold, cae enfermo. Junto a sus amigos, Shrek parte en busca de un heredero para el trono, mientras lidia con las expectativas de su familia política y su propio destino. Con un toque de humor característico y escenas de acción, la película resalta el valor de la familia y la aceptación personal.",
          "icono": "./public/peliculasImagenes/90.jpg",
          "video": "https://www.youtube.com/embed/MuUwZD2cb4A?si=T-Ttqv8uW7AILsFj",
          "categoria": "Animacion"
        },
        {
          "id": 91,
          "titulo": "Cómo entrenar a tu dragón",
          "fecha": "2010",
          "precio": 260,
          "description": "Un joven vikingo forja una amistad inesperada con un dragón mientras desafía tradiciones.",
          "descriptionModal": "En Cómo entrenar a tu dragón, Hipo, un joven vikingo, se enfrenta a la tradición de cazar dragones, pero su vida cambia cuando conoce a un dragón herido llamado Desdentao. A través de su amistad con la criatura, Hipo desafía las creencias de su tribu y demuestra que los dragones no son enemigos, sino seres inteligentes y nobles. La película presenta un mensaje sobre la aceptación, la valentía y la superación de prejuicios.",
          "icono": "./public/peliculasImagenes/91.jpg",
          "video": "https://www.youtube.com/embed/hJVL8U6ROck?si=5SuwqFOJ9lcHmOpN",
          "categoria": "Animacion"
        },
        {
          "id": 92,
          "titulo": "Cómo entrenar a tu dragón 2",
          "fecha": "2014",
          "precio": 270,
          "description": "Hipo y Chimuelo descubren una cueva secreta llena de dragones salvajes.",
          "descriptionModal": "En esta secuela, Hipo y su dragón Chimuelo encuentran una cueva secreta que alberga una gran variedad de dragones salvajes. A medida que exploran este nuevo mundo, descubren una amenaza que podría poner en peligro tanto a los dragones como a los vikingos. La película profundiza en la relación entre Hipo y su padre, mientras el joven héroe se enfrenta a un nuevo enemigo que desafía sus ideales y habilidades.",
          "icono": "./public/peliculasImagenes/92.jpg",
          "video": "https://www.youtube.com/embed/kxGkbv_HLZ0?si=ZN6Nw67-shuY4iif",
          "categoria": "Animacion"
        },
        {
          "id": 93,
          "titulo": "Cómo entrenar a tu dragón 3",
          "fecha": "2019",
          "precio": 280,
          "description": "Hipo y Chimuelo buscan un hogar para sus dragones mientras enfrentan un nuevo enemigo.",
          "descriptionModal": "En Cómo entrenar a tu dragón 3, Hipo y Chimuelo se embarcan en un viaje para encontrar un lugar seguro para todos los dragones, ya que el mundo está cambiando y los dragones son perseguidos por un villano que los quiere capturar. La película es un emotivo cierre de la saga, explorando temas de crecimiento, amor y sacrificio mientras los personajes enfrentan nuevos desafíos y relaciones.",
          "icono": "./public/peliculasImagenes/93.jpg",
          "video": "https://www.youtube.com/embed/nsYH4PRnd7s?si=nLolUwcHzYWpl6od",
          "categoria": "Animacion"
        },
        {
          "id": 94,
          "titulo": "Kung Fu Panda",
          "fecha": "2008",
          "precio": 250,
          "description": "Po, un oso panda torpe, se convierte en el Guerrero Dragón y debe salvar el Valle de la Paz.",
          "descriptionModal": "Kung Fu Panda sigue la historia de Po, un oso panda torpe que sueña con ser un gran maestro de kung fu. A pesar de sus limitaciones, Po es elegido como el Guerrero Dragón y, junto con los Cinco Furiosos, debe enfrentarse al malvado Tai Lung para salvar el Valle de la Paz. La película es una mezcla de acción, comedia y lecciones de perseverancia, mostrando que la verdadera fuerza proviene de la confianza en uno mismo.",
          "icono": "./public/peliculasImagenes/94.jpg",
          "video": "https://www.youtube.com/embed/vRhMIpFu-Zw?si=quG8vw_nbdHUGR9B",
          "categoria": "Animacion"
        },
        {
          "id": 95,
          "titulo": "Kung Fu Panda 2",
          "fecha": "2011",
          "precio": 260,
          "description": "Po descubre secretos sobre su pasado mientras enfrenta a un nuevo villano.",
          "descriptionModal": "En Kung Fu Panda 2, Po comienza a enfrentar su pasado mientras se enfrenta a un nuevo enemigo: el pavoroso Shen, un pavo real que busca destruir el kung fu. A medida que Po se adentra en su historia personal y descubre la verdad sobre su familia, debe encontrar el equilibrio entre su pasado y su destino como Guerrero Dragón. Esta secuela profundiza en la identidad y el crecimiento personal del protagonista, mientras entrega impresionantes escenas de acción.",
          "icono": "./public/peliculasImagenes/95.webp",
          "video": "https://www.youtube.com/embed/YCBxlwmUhmQ?si=jUD98SB3jSy4-iPO",
          "categoria": "Animacion"
        },
        {
          "id": 96,
          "titulo": "Kung Fu Panda 3",
          "fecha": "2016",
          "precio": 270,
          "description": "Po encuentra a su familia biológica y debe entrenar a una aldea de pandas para enfrentar una amenaza.",
          "descriptionModal": "Kung Fu Panda 3 sigue a Po mientras encuentra a su familia biológica y viaja a un remoto valle de pandas. Aquí, Po debe entrenar a sus nuevos amigos pandas para enfrentar a un villano que amenaza la paz del valle. La película es un viaje de autodescubrimiento para Po, mientras aprende sobre la importancia de la familia y la verdadera esencia del kung fu. Con un enfoque en la unidad, la historia mezcla emoción y humor.",
          "icono": "./public/peliculasImagenes/96.jpg",
          "video": "https://www.youtube.com/embed/hmRLBgMTaXA?si=B3UtStS7_gHD-tKi",
          "categoria": "Animacion"
        },
        {
          "id": 97,
          "titulo": "El gato con botas",
          "fecha": "2011",
          "precio": 240,
          "description": "El Gato con Botas se embarca en una aventura para robar los frijoles mágicos y encontrar el tesoro.",
          "descriptionModal": "En El Gato con Botas, el audaz y carismático felino busca una manera de redimir su nombre después de años de desventuras. Junto a sus amigos, se embarca en una misión para robar los frijoles mágicos y recuperar el tesoro perdido. La película es una mezcla de acción, comedia y fantasía, con un protagonista que combina valentía y encanto en su viaje lleno de emoción y risas.",
          "icono": "./public/peliculasImagenes/97.jpg",
          "video": "https://www.youtube.com/embed/mCs4vfBaABI?si=XZ0htS-prwyWCZXA",
          "categoria": "Animacion"
        },
        {
          "id": 98,
          "titulo": "El gato con botas: El último deseo",
          "fecha": "2022",
          "precio": 280,
          "description": "El Gato con Botas busca una estrella mágica para restaurar sus nueve vidas.",
          "descriptionModal": "El Gato con Botas: El último deseo sigue las aventuras del travieso felino en su búsqueda por encontrar una estrella mágica que le otorgue una nueva oportunidad para restaurar sus nueve vidas. A medida que se enfrenta a viejos y nuevos enemigos, el Gato con Botas aprende sobre el valor de la vida y la importancia de tomar decisiones sabias. Con humor, acción y una lección sobre la fragilidad de la existencia, la película es una obra que toca el corazón y divierte.",
          "icono": "./public/peliculasImagenes/98.jpg",
          "video": "https://www.youtube.com/embed/QaiUm8jNiCk?si=sAxANabK7Rhyr6rd",
          "categoria": "Animacion"
        },
        {
          "id": 99,
          "titulo": "Megamente",
          "fecha": "2010",
          "precio": 250,
          "description": "Un supervillano descubre su verdadero propósito tras derrotar a su enemigo.",
          "descriptionModal": "Megamente cuenta la historia de un supervillano llamado Megamente que, tras derrotar a su archienemigo, se ve obligado a encontrar un nuevo propósito en su vida. Con una trama llena de giros inesperados y humor irreverente, Megamente reflexiona sobre el papel del destino, el cambio personal y la verdadera naturaleza del heroísmo. La película es una divertida sátira sobre los estereotipos de los superhéroes, llena de acción y emoción.",
          "icono": "./public/peliculasImagenes/99.jpg",
          "video": "https://www.youtube.com/embed/ead9HCX9fe4?si=rSSmplibGFscw2oI",
          "categoria": "Animacion"
        },
        {
          "id": 100,
          "titulo": "Los Croods",
          "fecha": "2013",
          "precio": 240,
          "description": "Una familia prehistórica se aventura más allá de su cueva en busca de un nuevo hogar.",
          "descriptionModal": "Los Croods narra la historia de una familia prehistórica que, después de perder su hogar, se embarca en un peligroso pero emocionante viaje hacia lo desconocido. A medida que atraviesan paisajes extraordinarios y se enfrentan a criaturas fantásticas, la familia Crood debe adaptarse a un mundo nuevo y aprender a trabajar juntos. La película es una conmovedora aventura familiar que explora el crecimiento, la unidad y la supervivencia.",
          "icono": "./public/peliculasImagenes/100.jpg",
          "video": "https://www.youtube.com/embed/tplddmYEgMM?si=x9AWzEiMmNj3_OEx",
          "categoria": "Animacion"
        }

]